//поключение нужных дл€ программы библиотек
#include <iostream>
#include <math.h>
#include <cstdlib>
#include <ctime>
#include <conio.h>
using namespace std;//описание пространства имен
//начало тела программы
int main() {
	//описание переменных
	srand(time(NULL));//команда дл€ выбора случайного числа
	int i, n, c,a;//описание целочисленных
	double b;//описание переменных с плаващей точкой
	float max ;//описание строковых переменных
	int v[3];//описание целочисленного массива
	float s[3];//описание строкового массива
	setlocale(LC_CTYPE,"RUSSIAN");//перевод символов на русский €зык
	//выбор лошади
do //начало цикла do while
{
   cout<<"--------------------------------"<<endl;//вывод информации на экран
   cout<<"|¬ыберите одну из трех лошадей!|"<<endl;
   cout<<"--------------------------------"<<endl;
   cin>>n;//присвоение значени€ к переменной
   if (n>3)//начало команды "если"
   {
      cout<<"-------------------"<<endl;
      cout<<"|“акой лошади нет!|"<<endl;
      cout<<"-------------------"<<endl;
   }
}
while (n>3);//конец цикла
//алгоритм нахождени€ скорости лашадей
for(i=0; i<3; i++) //начало цикла for
    s[i]=rand()%21/2.1 + 30.0; //вычесление скорости кадой лошади
max=s[0];
for(i=0; i<3; i++)
{
    for (i=1; i<3; i++)
       if (s[i]>max)
	   {
       	  max=s[i];
       }
 }
cout<<"----------------------------------"<<endl;
cout<<"|єЋошади    —корость    –езультат|"<<endl;
cout<<"----------------------------------"<<endl;
//алгоритм вычислени€ победившей лошади
for(i=0; i<3; i++)
{
    cout<<"   "<<i+1<<"        "<<s[i];

	if (s[i]==max)
	{
	    c = i + 1;
        cout<<"      ѕобедил";
	}
    cout<<endl;
}
//вывод результата
if (c==n) //начало полной команды "если"
{
   cout<<"-------------"<<endl;
   cout<<"|¬ы выиграли|"<<endl;
   cout<<"-------------"<<endl;
}
else//продолжение команды "если", "иначе"
{
   cout<<"--------------"<<endl;
   cout<<"|¬ы проиграли|"<<endl;
   cout<<"--------------"<<endl;
}
system("pause");//задержка консоли
getch();//задержка окна экрана
}
